# 0. SQL(oracle)

### SQL 이란?

* 구조적 질의 언어
* 데이터를 검색하고 조작하는 언어
* 원하는 정보를 얻기위해(고객의 needs를 파악 가능) 데이터 분석가, 개발자 등 많은 업무에서 사용

>회사의 중요 데이터는 다 database에 저장되며 대용량 데이터라 데이터를 검색하는 시간이 오래걸림<br>
생각 안하고 SQL을 작성하면 시간이 오래걸려 빨리 결과를 보기 힘들 수 있어 검색시간을 고려하여 SQL을 작성<br>
오라클은 버전이 업그레이드 될 수록 점점 인공지능화 되어지고 있어서 SQL을 자체적으로 튜닝


### SQL의 종류

1. Query문 : 데이터를 검색하는 언어
> select문의 6가지절
2. DML문 : Data Manipulation Language
> insert(입력), update(수정), delete(삭제), merge(3가지 한번에 수행)
3. DDL문 : Data Definition Language
> create(생성), alter(수정), drop(삭제), truncate(삭제), rename(이름변경)
4. DCL문 : Data control Language
> grant(데이터 액세스[접근]권한 부여), revoke(액세스 권한 취소)
5. TCL문 : Transaction Control Language
> commit(현재 상태를 db에 영구히 저장), rollback(현재까지의 작업 취소), savepoint(특정시점까지 rollback)


### SQL 작성시 주의사항!

1. SQL은 대소문자를 구분하지 않는다.
2. 절 라인 다음으로 분리해서 작성한다<br>
     ex)<br> 
     select ename, sal → select 절<br>
     from emp; → from 절
3. 들여쓰기를 사용해서 SQL의 가독성을 높인다.<br>
     ex)<br>
     select ename, sal<br>
          from emp;
4. 가급적 소문자로 작성해야 오류를 찾는데 수월하다.

사용되는 기본 Table(emp/dept)

In [1]:
import sqlalchemy

In [ ]:
%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

In [4]:
%%sql
select * from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), Decimal('5000'), None, 10),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), Decimal('2850'), None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 5, 9, 0, 0), Decimal('2450'), None, 10),
 (7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 1, 0, 0), Decimal('2975'), None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 10, 0, 0), Decimal('1250'), Decimal('1400'), 30),
 (7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 11, 0, 0), Decimal('1600'), Decimal('300'), 30),
 (7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 8, 21, 0, 0), Decimal('1500'), Decimal('0'), 30),
 (7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 11, 0, 0), Decimal('950'), None, 30),
 (7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 23, 0, 0), Decimal('1250'), Decimal('500'), 30),
 (7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 11, 0, 0), Decimal('3000'), None, 20),
 (7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 9, 0, 0), Decimal('800'), None, 20),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 22, 0, 0), Decimal('3000'), None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 15, 0, 0), Decimal('1100'), None, 20),
 (7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 11, 0, 0), Decimal('1300'), None, 10)]

In [6]:
%%sql
select * from dept

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')]